; domain
(define (domain MakePotatoRibbons)
  (:requirements :strips :typing)

  (:types
    ingredient utensil appliance location dish - object
  )

  (:predicates
    ;;
    (at ?obj - object ?loc - location)

    ;;
    (washed ?potato - ingredient)
    (peeled ?potato - ingredient)
    (cut ?potato - ingredient)
    (drained ?potato - ingredient)
    (fried ?potato - ingredient)
    (in_dish ?potato - ingredient ?dish - dish)
    (clean ?utensil - utensil)
    (dirty ?utensil - utensil)
    (heated ?appliance - appliance)
    (has_oil ?appliance - appliance)
  )

  ;;   1：
  (:action wash_potatoes
    :parameters (?potato - ingredient ?sink - utensil ?cloth - utensil)
    :precondition (and
      (at ?potato kitchen_counter)
      (at ?sink kitchen_sink)
      (at ?cloth kitchen_counter)
      (clean ?sink)
    )
    :effect (and
      (washed ?potato)
      (dirty ?sink)
    )
  )

  ;;   2：
  (:action cut_potatoes
    :parameters (?potato - ingredient ?peeler - utensil)
    :precondition (and
      (washed ?potato)
      (at ?potato kitchen_counter)
      (at ?peeler kitchen_counter)
      (clean ?peeler)
    )
    :effect (and
      (peeled ?potato)
      (cut ?potato)
      (dirty ?peeler)
    )
  )

  ;;   3：
  (:action drain_potatoes
    :parameters (?potato - ingredient ?cloth - utensil)
    :precondition (and
      (cut ?potato)
      (at ?potato kitchen_counter)
      (at ?cloth kitchen_counter)
      (clean ?cloth)
    )
    :effect (and
      (drained ?potato)
      (dirty ?cloth)
    )
  )

  ;;   4：
  (:action fry_potatoes
    :parameters (?potato - ingredient ?pan - utensil ?stove - appliance)
    :precondition (and
      (drained ?potato)
      (at ?pan kitchen_stove)
      (at ?stove kitchen_stove)
      (clean ?pan)
      (heated ?stove)
      (has_oil ?stove)
    )
    :effect (and
      (fried ?potato)
      (dirty ?pan)
    )
  )

  ;;   5：
  (:action serve_potatoes
    :parameters (?potato - ingredient ?dish - dish)
    :precondition (and
      (fried ?potato)
      (at ?dish dining_table)
    )
    :effect (and
      (in_dish ?potato ?dish)
      (not (fried ?potato))
    )
  )
)

; problem
(define (problem MakePotatoRibbons_problem)
  (:domain MakePotatoRibbons)

  (:objects
    ;;
    potato1 potato2 - ingredient

    ;;
    peeler1 - utensil
    pan1 - utensil
    sink1 - utensil
    cloth1 - utensil

    ;;
    stove1 - appliance

    ;;
    kitchen_counter kitchen_sink dining_table kitchen_stove - location

    ;;
    dish1 - dish
  )

  (:init
    ;;
    (at potato1 kitchen_counter)
    (at potato2 kitchen_counter)

    ;;
    (at peeler1 kitchen_counter)
    (at pan1 kitchen_stove)
    (at sink1 kitchen_sink)
    (at cloth1 kitchen_counter)

    ;;
    (at stove1 kitchen_stove)
    (heated stove1)
    (has_oil stove1)

    ;;
    (clean peeler1)
    (clean pan1)
    (clean sink1)
    (clean cloth1)
    (at dish1 dining_table)

    ;;
    (not (washed potato1))
    (not (peeled potato1))
    (not (cut potato1))
    (not (drained potato1))
    (not (fried potato1))

    (not (washed potato2))
    (not (peeled potato2))
    (not (cut potato2))
    (not (drained potato2))
    (not (fried potato2))
  )

  (:goal
    (and
      ;;
      (in_dish potato1 dish1)
      (in_dish potato2 dish1)
    )
  )
)

; plan
1. (wash_potatoes potato1 sink1 cloth1)
   added: (washed potato1) (dirty sink1)
   goals met: 0 of 2
2. (wash_potatoes potato2 sink1 cloth1)
   added: (washed potato2)
   goals met: 0 of 2
3. (cut_potatoes potato2 cloth1)
   added: (peeled potato2) (cut potato2) (dirty cloth1)
   goals met: 0 of 2
4. (cut_potatoes potato1 cloth1)
   added: (peeled potato1) (cut potato1)
   goals met: 0 of 2
5. (drain_potatoes potato2 cloth1)
   added: (drained potato2)
   goals met: 0 of 2
6. (drain_potatoes potato1 cloth1)
   added: (drained potato1)
   goals met: 0 of 2
7. (fry_potatoes potato2 pan1 stove1)
   added: (fried potato2) (dirty pan1)
   goals met: 0 of 2
8. (fry_potatoes potato1 pan1 stove1)
   added: (fried potato1)
   goals met: 0 of 2
9. (serve_potatoes potato2 dish1)
   deleted: (fried potato2)
   added: (in_dish potato2 dish1)
   goals met: 1 of 2
10. (serve_potatoes potato1 dish1)
   deleted: (fried potato1)
   added: (in_dish potato1 dish1)
   goals met: 2 of 2
